mounth = int(input("введите месяц 1-12 >>> "))

if mounth > 0 and mounth < 13:
    mounth_list = ["зима", "весна", "лето", "осень", "зима"]
    mounth_dict = {1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето",
                   7: "лето", 8: "лето", 9: "осень", 10: "осень", 11: "осень", 12: "зима"}
    i = (mounth)//3
    print(f"Результат через список: {mounth_list[i]}")
    print(f"Результат через словарь: {mounth_dict.get(mounth)}")
    # это чтобы не закрывалось окно консоли
    input('Нажмите Enter для выхода\n')

else:
    print("диапазон ввода не соответствует требованиям (1-12)")
    # это чтобы не закрывалось окно консоли
    input('Нажмите Enter для выхода\n')
